problem-1

In [1]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

import pandas as pd
#lets store it inside a list otherwise we can do with the numpy also
l=[4,8,15,16,23,42]

df=pd.Series(l)
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

problem-2

In [2]:
'''Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.'''

import pandas as pd
l1=[23,"pandas",45,67,89,34,60,"abc",45.56,12]

df=pd.Series(l1)
df

0        23
1    pandas
2        45
3        67
4        89
5        34
6        60
7       abc
8     45.56
9        12
dtype: object

problem-3

In [3]:
import pandas as pd

dict={
    "Name":['Alice','Bob','Claire'],
    "Age":['25','30','27'],
    "Gender":['Female','Male','Female']
}

df1=pd.DataFrame(dict)
df1

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

problem-4

In [4]:
#Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
'''ans= We can say that dataframe is a complete representation as like dataset which is 2d,that means
contains both rows and columns.Whereas pandas series is a 1d array.

example:'''
#pandas series:
import pandas as pd
l1=[23,"pandas",45,67,89,34,60,"abc",45.56,12]

df=pd.Series(l1)
print(df)

#pandas dataframe:

dict={
    "Name":['Alice','Bob','Claire'],
    "Age":['25','30','27'],
    "Gender":['Female','Male','Female']
}

df1=pd.DataFrame(dict)
df1

0        23
1    pandas
2        45
3        67
4        89
5        34
6        60
7       abc
8     45.56
9        12
dtype: object

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

problem-5

In [5]:
'''Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?'''

'''ans-->there are many used pandas function like;

pd.read_csv
pd.to_csv

like after converting it to dataframe:
df=pd.DataFrame(something.data,columns=something.features_names)

df.head()
df.tail()
df.shape()
df.describe()

and lots of others....'''
#example:

import pandas as pd
dict={
    "Name":['Alice','Bob','Claire'],
    "Age":['25','30','27'],
    "Gender":['Female','Male','Female']
}

df1=pd.DataFrame(dict)
print(df1)
print(df1.shape)

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female
(3, 3)

problem-6

In [6]:
#Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
'''ans-->in both data can be mutable'''

'ans-->in both data can be mutable'

problem-7

In [7]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.
'''ans--->with the help of concatenation we can do this'''

import pandas as pd
s1 = pd.Series([5,10], index=["a","b"])
s2 = pd.Series([16,15], index=["a","b"])
pd.concat([s1,s2], axis=1)

    0   1
a   5  16
b  10  15